<img src="img/dsci513_header2.png" width="600">

# Lecture 5: Transactions, ACID, subqueries

**Arman Seyed-Ahmadi, November 2021**

## Lecture outline

- Transactions
- ACID properties
- Subqueries
- Set operations (OPTIONAL)

## Transactions: all or nothing

Let's consider the classical example of a bank database. Suppose that I bought a vintage guitar from my friend, Joel, for $\$1000$, and now I want to transfer $\$1000$ from my bank account to Joel's account using the banking app on my phone. This operation involves:

1. Deducting (i.e. debiting) $\$1000$ from my account,
2. Adding (i.e. crediting) $\$1000$ to Joel's account.

We've already learned how to do this in SQL:

```sql
-- debiting source account
UPDATE
    accounts
SET
    balance = balance - 1000.0
WHERE
    account_number = 1132;

-- crediting target account
UPDATE
    accounts
SET
    balance = balance + 1000.0
WHERE
    account_number = 1279;
```

Now, what if a power outage happens right between the two `UPDATE` statements? In that case, my account would be left debited $\$1000$, while Joel has also received no money. We'd both be furious!

This example nicely illustrates a common situation where we would want either **all** or **none** of the changes to be made to the database. In other words, the changes need to be considered and treated as **a single logical unit of work**, such that either all changes are successfully made, or all of them should fail.

In database (and in banking) terms, these units of work are called **transactions**.

### Transactions in Postgres

In order to bundle the above update statements into one single transaction, we can use the following syntax:

```sql
BEGIN TRANSACTION;

-- debiting source account
UPDATE
    accounts
SET
    balance = balance - 1000.0
WHERE
    account_number = 1132;

-- crediting target account
UPDATE
    accounts
SET
    balance = balance + 1000.0
WHERE
    account_number = 1279;
    
COMMIT;
```

With the above transaction, now the DBMS knows how to treat the SQL commands: both update commands are a part of a larger unit of work. Either both changes need to be made, or none.

The overall structure of a transaction is as follows:

```sql
[{BEGIN|START} [TRANSACTION]];

<SQL statements>

{COMMIT|ROLLBACK};
```

**Commit:** All data modifications during the transaction should be made permanent in the database.

**Rollback:** All changes made during the transaction should be discarded, and the database is restored to its original state before the transaction.

Note that `BEGIN` and `START` can be used interchangeably, although `BEGIN` is much more common. Moreover, the `BEGIN TRANSACTION` statement is optional. You can also start a transaction just using the command `BEGIN;` without the keyword `TRANSACTION`.

In [15]:
import pandas as pd
import json
import psycopg2
import urllib.parse

with open('data/credentials.json') as f:
    login = json.load(f)
    
username = login['user']
password = urllib.parse.quote(login['password'])
host = login['host']
port = login['port']

In [2]:
%load_ext sql
%config SqlMagic.displaylimit = 30

In [3]:
%sql postgresql://{username}:{password}@{host}:{port}/mds

'Connected: postgres@mds'

In [32]:
%%sql

DROP TABLE IF EXISTS
    instructor,
    instructor_course,
    course_cohort
;

CREATE TABLE instructor (
    id INTEGER PRIMARY KEY,
    name TEXT,
    email TEXT,
    phone VARCHAR(12),
    department VARCHAR(50)
    )
;

INSERT INTO
    instructor (id, name, email, phone, department)
VALUES
    (1, 'Mike', 'mike@mds.ubc.ca', '605-332-2343', 'Computer Science'),
    (2, 'Tiffany', 'tiff@mds.ubc.ca', '445-794-2233', 'Neuroscience'),
    (3, 'Arman', 'arman@mds.ubc.ca', '935-738-5796', 'Physics'),
    (4, 'Varada', 'varada@mds.ubc.ca', '243-924-4446', 'Computer Science'),
    (5, 'Quan', 'quan@mds.ubc.ca', '644-818-0254', 'Economics'),
    (6, 'Joel', 'joel@mds.ubc.ca', '773-432-7669', 'Biomedical Engineering'),
    (7, 'Florencia', 'flor@mds.ubc.ca', '773-926-2837', 'Biology'),
    (8, 'Alexi', 'alexiu@mds.ubc.ca', '421-888-4550', 'Statistics'),
    (15, 'Vincenzo', 'vincenzo@mds.ubc.ca', '776-543-1212', 'Statistics'),
    (19, 'Gittu', 'gittu@mds.ubc.ca', '776-334-1132', 'Biomedical Engineering'),
    (16, 'Jessica', 'jessica@mds.ubc.ca', '211-990-1762', 'Computer Science')
;

    
CREATE TABLE instructor_course (
    id SERIAL PRIMARY KEY,
    instructor_id INTEGER,
    course TEXT,
    enrollment INTEGER,
    begins DATE
    )
;

INSERT INTO
    instructor_course (instructor_id, course, enrollment, begins)
VALUES
    (8, 'Statistical Inference and Computation I', 125, '2021-10-01'),
    (8, 'Regression II', 102, '2022-02-05'),
    (1, 'Descriptive Statistics and Probability', 79, '2021-09-10'),
    (1, 'Algorithms and Data Structures', 25, '2021-10-01'),
    (3, 'Algorithms and Data Structures', 25, '2021-10-01'),
    (3, 'Python Programming', 133, '2021-09-07'),
    (3, 'Databases & Data Retrieval', 118, '2021-11-16'),
    (6, 'Visualization I', 155, '2021-10-01'),
    (6, 'Privacy, Ethics & Security', 148, '2022-03-01'),
    (2, 'Programming for Data Manipulation', 160, '2021-09-08'),
    (7, 'Data Science Workflows', 98, '2021-09-15'),
    (2, 'Data Science Workflows', 98, '2021-09-15'),
    (12, 'Web & Cloud Computing', 78, '2022-02-10'),
    (10, 'Introduction to Optimization', NULL, '2022-09-01'),
    (9, 'Parallel Computing', NULL, '2023-01-10'),
    (13, 'Natural Language Processing', NULL, '2023-09-10')
;

CREATE TABLE course_cohort (
    id INTEGER,
    cohort VARCHAR(7)
    )
;

INSERT INTO
    course_cohort (id, cohort)
VALUES
    (13, 'MDS-CL'),
    (8, 'MDS-CL'),
    (1, 'MDS-CL'),
    (3, 'MDS-CL'),
    (1, 'MDS-V'),
    (9, 'MDS-V'),
    (9, 'MDS-V'),
    (3, 'MDS-V')
;

 * postgresql://postgres:***@localhost:5432/mds
Done.
Done.
11 rows affected.
Done.
16 rows affected.
Done.
8 rows affected.

[]

In [5]:
%sql SELECT * FROM instructor;

 * postgresql://postgres:***@localhost:5432/mds
11 rows affected.

[(1, 'Mike', 'mike@mds.ubc.ca', '605-332-2343', 'Computer Science'),
 (2, 'Tiffany', 'tiff@mds.ubc.ca', '445-794-2233', 'Neuroscience'),
 (3, 'Arman', 'arman@mds.ubc.ca', '935-738-5796', 'Physics'),
 (4, 'Varada', 'varada@mds.ubc.ca', '243-924-4446', 'Computer Science'),
 (5, 'Quan', 'quan@mds.ubc.ca', '644-818-0254', 'Economics'),
 (6, 'Joel', 'joel@mds.ubc.ca', '773-432-7669', 'Biomedical Engineering'),
 (7, 'Florencia', 'flor@mds.ubc.ca', '773-926-2837', 'Biology'),
 (8, 'Alexi', 'alexiu@mds.ubc.ca', '421-888-4550', 'Statistics'),
 (15, 'Vincenzo', 'vincenzo@mds.ubc.ca', '776-543-1212', 'Statistics'),
 (19, 'Gittu', 'gittu@mds.ubc.ca', '776-334-1132', 'Biomedical Engineering'),
 (16, 'Jessica', 'jessica@mds.ubc.ca', '211-990-1762', 'Computer Science')]

In [6]:
conn = psycopg2.connect(database='mds', **login)

Let's take a look at the following example. Here I begin a transaction and try to set all phone numbers in the `instructor` table to `NULL`:

In [7]:
cur = conn.cursor()
cur.execute("""
    BEGIN TRANSACTION;
    
    UPDATE
        instructor
    SET
        phone = NULL;
    """)

Within the current database session/connection, the changes are visible:

In [20]:
cur.execute("SELECT * FROM instructor")
cur.fetchall()

[(1, 'Mike', 'mike@mds.ubc.ca', None, 'Computer Science'),
 (2, 'Tiffany', 'tiff@mds.ubc.ca', None, 'Neuroscience'),
 (3, 'Arman', 'arman@mds.ubc.ca', None, 'Physics'),
 (4, 'Varada', 'varada@mds.ubc.ca', None, 'Computer Science'),
 (5, 'Quan', 'quan@mds.ubc.ca', None, 'Economics'),
 (6, 'Joel', 'joel@mds.ubc.ca', None, 'Biomedical Engineering'),
 (7, 'Florencia', 'flor@mds.ubc.ca', None, 'Biology'),
 (8, 'Alexi', 'alexiu@mds.ubc.ca', None, 'Statistics'),
 (15, 'Vincenzo', 'vincenzo@mds.ubc.ca', None, 'Statistics'),
 (19, 'Gittu', 'gittu@mds.ubc.ca', None, 'Biomedical Engineering'),
 (16, 'Jessica', 'jessica@mds.ubc.ca', None, 'Computer Science')]

Well, we can see that the phone number column in all of the above tuples returned by psycopg2 is set to `NULL` (shown as `None` in Python).

However, if we look at the database from the viewpoint of any other connection/session/user, no changes seem to have been made:

In [21]:
%sql SELECT * FROM instructor;

 * postgresql://postgres:***@localhost:5432/mds
11 rows affected.

[(1, 'Mike', 'mike@mds.ubc.ca', '605-332-2343', 'Computer Science'),
 (2, 'Tiffany', 'tiff@mds.ubc.ca', '445-794-2233', 'Neuroscience'),
 (3, 'Arman', 'arman@mds.ubc.ca', '935-738-5796', 'Physics'),
 (4, 'Varada', 'varada@mds.ubc.ca', '243-924-4446', 'Computer Science'),
 (5, 'Quan', 'quan@mds.ubc.ca', '644-818-0254', 'Economics'),
 (6, 'Joel', 'joel@mds.ubc.ca', '773-432-7669', 'Biomedical Engineering'),
 (7, 'Florencia', 'flor@mds.ubc.ca', '773-926-2837', 'Biology'),
 (8, 'Alexi', 'alexiu@mds.ubc.ca', '421-888-4550', 'Statistics'),
 (15, 'Vincenzo', 'vincenzo@mds.ubc.ca', '776-543-1212', 'Statistics'),
 (19, 'Gittu', 'gittu@mds.ubc.ca', '776-334-1132', 'Biomedical Engineering'),
 (16, 'Jessica', 'jessica@mds.ubc.ca', '211-990-1762', 'Computer Science')]

Well, that's because the changes we've made in our original connection are not made permanent until we issue a `COMMIT` command:

In [22]:
cur = conn.cursor()
cur.execute("COMMIT;")

In [23]:
%sql SELECT * FROM instructor;

 * postgresql://postgres:***@localhost:5432/mds
11 rows affected.

[(1, 'Mike', 'mike@mds.ubc.ca', None, 'Computer Science'),
 (2, 'Tiffany', 'tiff@mds.ubc.ca', None, 'Neuroscience'),
 (3, 'Arman', 'arman@mds.ubc.ca', None, 'Physics'),
 (4, 'Varada', 'varada@mds.ubc.ca', None, 'Computer Science'),
 (5, 'Quan', 'quan@mds.ubc.ca', None, 'Economics'),
 (6, 'Joel', 'joel@mds.ubc.ca', None, 'Biomedical Engineering'),
 (7, 'Florencia', 'flor@mds.ubc.ca', None, 'Biology'),
 (8, 'Alexi', 'alexiu@mds.ubc.ca', None, 'Statistics'),
 (15, 'Vincenzo', 'vincenzo@mds.ubc.ca', None, 'Statistics'),
 (19, 'Gittu', 'gittu@mds.ubc.ca', None, 'Biomedical Engineering'),
 (16, 'Jessica', 'jessica@mds.ubc.ca', None, 'Computer Science')]

Voila, the changes are now permanently recorded in the database, and visible by any user/connection. Note that instead of running `COMMIT;` as a SQL statement, we could have run `conn.commit()`.

Here's an example of `ROLLBACK`. I'm going to delete all rows from the `instructor` table in a transaction:

In [24]:
cur.execute("""
    BEGIN TRANSACTION;
    
    DELETE FROM instructor;
    """)

In [24]:
cur.execute("SELECT * FROM instructor")
cur.fetchall()

[]

As expected, there are no rows in the instructor table.

Because the transaction is still ongoing and changes have not been made permanent, I can abort and rollback the transaction to have the database back at its original state before the transaction:

In [26]:
cur.execute("ROLLBACK;")

In [27]:
cur.execute("SELECT * FROM instructor")
cur.fetchall()

[(1, 'Mike', 'mike@mds.ubc.ca', None, 'Computer Science'),
 (2, 'Tiffany', 'tiff@mds.ubc.ca', None, 'Neuroscience'),
 (3, 'Arman', 'arman@mds.ubc.ca', None, 'Physics'),
 (4, 'Varada', 'varada@mds.ubc.ca', None, 'Computer Science'),
 (5, 'Quan', 'quan@mds.ubc.ca', None, 'Economics'),
 (6, 'Joel', 'joel@mds.ubc.ca', None, 'Biomedical Engineering'),
 (7, 'Florencia', 'flor@mds.ubc.ca', None, 'Biology'),
 (8, 'Alexi', 'alexiu@mds.ubc.ca', None, 'Statistics'),
 (15, 'Vincenzo', 'vincenzo@mds.ubc.ca', None, 'Statistics'),
 (19, 'Gittu', 'gittu@mds.ubc.ca', None, 'Biomedical Engineering'),
 (16, 'Jessica', 'jessica@mds.ubc.ca', None, 'Computer Science')]

For us Postgres users through psycopg2 in Python, it is important not to leave transactions open unintentionally. By default, even a `SELECT` statement begins a transaction (see [here](https://www.psycopg.org/docs/usage.html#transactions-control)), and unless the transaction is committed or rolled back explicitly, the session remains in the undesirable idle transaction state.

In order to avoid an unintentionally long-running transaction, we can do one of the following things:

- Use auto-commit mode by running `conn.autocommit = True`. In this mode, every executed statement is automatically committed if successful, and rolled back if an error occurs.

- Use `with` context manager for the connection and the cursor:
  ```python
  with conn, conn.cursor() as cur:
      cur.execute("SELECT * FROM instructor;")
  ```

  The transaction is committed when a connection exits the `with` block with no raised exceptions, otherwise the transaction is rolled back.

In [30]:
with conn, conn.cursor() as cur:
    cur.execute("DELETE FROM instructor;")

In [31]:
%sql SELECT * FROM instructor;

 * postgresql://postgres:***@localhost:5432/mds
0 rows affected.

[]

> **Note:** Exiting the `with` block does not close a connection (as opposed to reading files using `with`). To close a connection, you need to explicitly run `conn.close()`.

> **Note:** `psql` runs in auto-commit mode by default.

> **Note:** `ipython-sql` runs in auto-commit mode by default.

In [29]:
%config SqlMagic.autocommit

True

### Transaction log

The DBMS keeps a history of all changes made to the database during a transaction in a log file, that is internally used by the database. These transaction log files contain enough information so that the DBMS can undo or redo modifications. Therefore, the log file contains a critical piece of information, which is why a database and transaction logs are never stored on the same physical disk in production databases.

In Postgres, every SQL statement is executed withing a transaction, either implicitly or explicitly. So by default, there are implicit `BEGIN` and `COMMIT` commands before and after every statement. This is why you might hear that DBMSs are by default in **auto-commit** mode.

Postgres uses a technique called [Write Ahead Log](https://www.postgresql.org/docs/current/wal-intro.html), which records the changes to be made in the transaction in the log file before actually making the changes to the database.

The WAL technique reduces number of disk writes significantly, because not every transaction commit needs to modify data files: only the log file needs to be written on a permanent disk. Also, the log is written sequentially, which is way faster than modifying data files in place.

Postgres also supports point-in-time recovery thanks the transaction log files. If we have a backup or snapshot of the database at some point in time along with the log files, the database can be restored to any stated recorded in the logs by replaying the changes.

### Transactions & integrity constraints

One thing we didn't talk about when discussing integrity constraints in Lecture 4 was that some constraints be made to behave differently inside a transaction block. Let's consider the following example.

Suppose that for some reason it is necessary to swap the `id` values for Mike and Tiffany in the `instructor` table:

In [33]:
%sql SELECT * FROM instructor WHERE name IN ('Mike', 'Tiffany');

 * postgresql://postgres:***@localhost:5432/mds
2 rows affected.

[(1, 'Mike', 'mike@mds.ubc.ca', '605-332-2343', 'Computer Science'),
 (2, 'Tiffany', 'tiff@mds.ubc.ca', '445-794-2233', 'Neuroscience')]

You might want to try the following SQL statements to do the swap:

In [ ]:
%%sql

UPDATE
    instructor
SET
    id = 2
WHERE
    name = 'Mike';
    
UPDATE
    instructor
SET
    id = 2
WHERE
    name = 'Tiffany';

But that does not work, because `id` is the primary key column of the `instructor` table, and as soon as we set the `id` for "Mike" to 2, and integrity error is raised (as expected). This is because value 2 for `id` already exists in the table (and belongs to Tiffany), and we've learned that primary key columns cannot contain duplicate values. So what's the solution here?

One way to make this change is to use **deferrable** constraints. In Postgres, the `PRIMARY KEY`, `REFERENCES`, and `UNIQUE` constraints are by default `NOT DEFERRABLE`. This means that these constrains are checked immediately after running **each statement** that triggers integrity checks. 

However, we can optionally make these constraints `DEFERRABLE` within a transaction block, meaning that the constraints are checked at the end of the transaction. In order to set constraints to deferrable, the following options are possible:

- `DEFERRABLE INITIALLY DEFERRED`: The constraint will not be checked until the end of a transaction by default.
- `DEFERRABLE INITIALLY IMMEDIATE`: The constrain will not be checked only if `SET CONSTRAINTS {name, ...|ALL} DEFERRED` is used in the transaction. This is the default when `DEFERRABLE` is used.

For our example here, we could have set the primary key of the `instructor` table to `DEFERRABLE INITIALLY DEFERRED`:

```sql
CREATE TABLE instructor (
    id INTEGER PRIMARY KEY DEFERRABLE,
    name TEXT,
    email TEXT,
    phone VARCHAR(12),
    department VARCHAR(50)
    )
;
```

so that the primary key constraint is not checked until the end of the transaction.

Instead of recreating the `instructor` table (which might not always be an option), I'll use `ALTER TABLE` to change the primary key constraint:

In [36]:
%%sql

ALTER TABLE
    instructor
DROP CONSTRAINT
    instructor_pkey;
    
ALTER TABLE
    instructor
ADD PRIMARY KEY (id) DEFERRABLE INITIALLY DEFERRED;

 * postgresql://postgres:***@localhost:5432/mds
Done.
Done.

[]

Now the primary key constraint should not pose a problem if we make the changes within a transaction block:

In [37]:
with conn, conn.cursor() as cur:
    cur.execute("""
    BEGIN TRANSACTION;
    
    UPDATE
        instructor
    SET
        id = 2
    WHERE
        name = 'Mike';
        
    UPDATE
        instructor
    SET
        id = 1
    WHERE
        name = 'Tiffany';
        
    COMMIT;
    """)

In [38]:
%sql SELECT * FROM instructor WHERE name IN ('Mike', 'Tiffany');

 * postgresql://postgres:***@localhost:5432/mds
2 rows affected.

[(2, 'Mike', 'mike@mds.ubc.ca', '605-332-2343', 'Computer Science'),
 (1, 'Tiffany', 'tiff@mds.ubc.ca', '445-794-2233', 'Neuroscience')]

Alternatively, we could have set `PRIMARY KEY (id) DEFERRABLE` and use `SET CONSTRAINTS ALL DEFERRED` at the beginning of the transaction.

## ACID

In the database world, a transaction must have a number of properties to guarantee data integrity and validity, which ensure that in the event of any sort of database failure, the data will not be corrupt or lost. These properties are **atomicity, consistency, isolation, and durability (ACID)**.

### Atomicity

This is the all-or-nothing property of a transaction that we've seen earlier. Transactions should be atomic, meaning that the whole transaction is supposed to be treated as a single unit of work. Either all or none of the operations inside a transaction are executed.

**Example**: We have a database with one table (_Values_) and two columns (**a** and **b**).  We have an operation where, on a particular row, a value is subtracted from **a** and added to **b**.  This might be similar to a banking transaction, where I withdraw money from my account to pay for a new pair of slippers.  The operation takes place in two steps:

1.  Remove value from **a**
2.  Place value in **b**

Atomicity ensures that if a system failure occurs between steps one and two, or if either step one or step two is invalid for any other reason, the entire transaction will not be processed.

### Consistency

You've seen in the previous section that some constraints were temporarily violated inside a transaction, but by the end of the transaction all constraints were respected. It is the responsibility of a transaction to maintain data integrity. If a transaction makes the database inconsistent or invalid (i.e. in violation of the constraints), the transaction is aborted and the database is brought back to the consistent state before the transaction.

**Example**:  We have a table *marks* that gives the breakdown of marking schemes for various courses.  It is divided into columns for **quiz**, **participation**, **midterm** and **final**.  All fields must be integers, and, because these values make up the course marking scheme, each row must sum to 100.  We can add a constraint to the table that ensures this using the `CHECK` operator.

A database that ensures consistency would reject any transaction where the final result of the transaction results in a *marks* sum <> 100.

### Isolation

Each database modification operation is either implicitly or explicitly run within a transaction. The DBMS guarantees that each transaction is kept separate and isolated from any other transaction. No other transaction can interfere with the current transaction that is in progress. Although it would be ideal to have the highest levels of isolation, this would cause serious performance issues in real-world applications. So depending on the situation, there are various levels of isolation that can be used as a trade-off between full isolation of transactions and concurrency.

**Example**:  In that same *marks* table as before, let's assume that a department has made a decision that all **final** exam scores will be reduced by 5% and that that value will be shifted to **participation**.  At the same time, an individual instructor in the program has decided to increase the weighting of the **final** and reduce the weighting of the **midterm**.

If these operations are not isolated, it is possible that the program-level transaction reduces the weighting of the final exam.

### Durability

The changes that are made by a successful transaction are permanent, even if there is a failure and the database shuts down. In Postgres and other relational databases, this is achieved by using transaction logs.

**Example**: Data that goes in following a successfully completed transaction doesn't come out unless another transaction operates to remove the data.

## Subqueries

There is a particular type of question that we have avoided so far for our SQL queries, and that is one for which we need the result of a second query to be able to run the first query. Take the following question as an example:

---

**Example:** Using the `world_dsci513` database, find the countries with surface area above the average value of all countries in the world.

---

This query looks simple. You might be tempted to try

```sql
-- This will NOT work
SELECT
    name
FROM
    country
WHERE
    surfacearea > AVG(surfacearea)
;
```

but we've learned before that aggregate functions **cannot** be used within a `WHERE` clause.

To answer this question, we need to query the database twice: once to obtain the average surface area, and once to actually retrieve the rows that satisfy the condition. However, we don't need to do that in two separate queries and manually take the data coming from the first query and use it in the second. We can use a **subquery** to do that for us.

A subquery is a `SELECT` statement that is incorporated into another SQL statement. For example, the query that computes the average surface area is:

```sql
SELECT
    AVG(surfacearea)
FROM
    country
;
```

We can use this intermediate information in our original query by embedding the above query in the `WHERE` clause of the original query:

```sql
SELECT
    name
FROM
    country
WHERE
    surfacearea > (
        SELECT AVG(surfacearea) FROM country
    )
;
```

In [39]:
%sql postgresql://{username}:{password}@{host}:{port}/world_dsci513

'Connected: postgres@world_dsci513'

In [41]:
%%sql

SELECT
    name
FROM
    country
WHERE
    surfacearea > (
        SELECT
            AVG(surfacearea)
        FROM
            country
    )
;

   postgresql://postgres:***@localhost:5432/mds
 * postgresql://postgres:***@localhost:5432/world_dsci513
43 rows affected.

[('Afghanistan',),
 ('Algeria',),
 ('Angola',),
 ('Argentina',),
 ('Australia',),
 ('Bolivia',),
 ('Brazil',),
 ('Chile',),
 ('Egypt',),
 ('South Africa',),
 ('Ethiopia',),
 ('Greenland',),
 ('Indonesia',),
 ('India',),
 ('Iran',),
 ('Canada',),
 ('Kazakstan',),
 ('China',),
 ('Colombia',),
 ('Congo, The Democratic Republic of the',),
 ('Libyan Arab Jamahiriya',),
 ('Mali',),
 ('Mauritania',),
 ('Mexico',),
 ('Mongolia',),
 ('Mozambique',),
 ('Myanmar',),
 ('Namibia',),
 ('Niger',),
 ('Nigeria',),
 ('Pakistan',),
 ('Peru',),
 ('Zambia',),
 ('Saudi Arabia',),
 ('Somalia',),
 ('Sudan',),
 ('Tanzania',),
 ('Chad',),
 ('Turkey',),
 ('Venezuela',),
 ('Russian Federation',),
 ('United States',),
 ('Antarctica',)]

Note that:

- A subquery should always be enclosed in parentheses, e.g. `(SELECT ...)`
- Subqueries should **not** be terminated by a semi-colon, as opposed to regular queries
- Sometimes the main SQL statement is called the **outer query** and the subquery is called the **inner query**

A subquery can be used in the `SELECT`, `FROM`, `WHERE`, and `HAVING` clauses, but most commonly in the `WHERE`.

In our last query, we can use a subquery in the `SELECT` clause as well to check if the returned rows do satisfy the condition of `surfacearea > AVG(surfacearea)`:

In [42]:
%%sql

SELECT
    name,
    ROUND(surfacearea::NUMERIC / (SELECT AVG(surfacearea) FROM country)::NUMERIC, 2)
        AS ratio
FROM
    country
WHERE
    surfacearea > (
        SELECT AVG(surfacearea) FROM country
    )
ORDER BY
    ratio
;

   postgresql://postgres:***@localhost:5432/mds
 * postgresql://postgres:***@localhost:5432/world_dsci513
43 rows affected.

[('Somalia', Decimal('1.02')),
 ('Afghanistan', Decimal('1.05')),
 ('Myanmar', Decimal('1.09')),
 ('Zambia', Decimal('1.21')),
 ('Chile', Decimal('1.21')),
 ('Turkey', Decimal('1.24')),
 ('Pakistan', Decimal('1.28')),
 ('Mozambique', Decimal('1.29')),
 ('Namibia', Decimal('1.32')),
 ('Tanzania', Decimal('1.42')),
 ('Venezuela', Decimal('1.46')),
 ('Nigeria', Decimal('1.48')),
 ('Egypt', Decimal('1.61')),
 ('Mauritania', Decimal('1.65')),
 ('Bolivia', Decimal('1.76')),
 ('Ethiopia', Decimal('1.77')),
 ('Colombia', Decimal('1.83')),
 ('South Africa', Decimal('1.96')),
 ('Mali', Decimal('1.99')),
 ('Angola', Decimal('2.00')),
 ('Niger', Decimal('2.03')),
 ('Chad', Decimal('2.06')),
 ('Peru', Decimal('2.06')),
 ('Mongolia', Decimal('2.51')),
 ('Iran', Decimal('2.64')),
 ('Libyan Arab Jamahiriya', Decimal('2.82')),
 ('Indonesia', Decimal('3.06')),
 ('Mexico', Decimal('3.14')),
 ('Saudi Arabia', Decimal('3.45')),
 ('Greenland', Decimal('3.48')),
 ('Congo, The Democratic Republic of the', Decimal('3.76')),
 ('Algeria', Decimal('3.82')),
 ('Sudan', Decimal('4.02')),
 ('Kazakstan', Decimal('4.37')),
 ('Argentina', Decimal('4.46')),
 ('India', Decimal('5.27')),
 ('Australia', Decimal('12.42')),
 ('Brazil', Decimal('13.71')),
 ('United States', Decimal('15.02')),
 ('China', Decimal('15.36')),
 ('Canada', Decimal('16.00')),
 ('Antarctica', Decimal('21.05')),
 ('Russian Federation', Decimal('27.40'))]

> **Note:** A subquery in the `SELECT` clause should always return a single value, not a column or rows of values.

---

**Example:** Retrieve the name of countries whose capital cities have a population larger than 5 million.

---

In [58]:
%%sql

SELECT
    name
FROM
    country
WHERE
    capital IN (
        SELECT id
        FROM city
        WHERE population > 5000000
    )
;

   postgresql://postgres:***@localhost:5432/mds
 * postgresql://postgres:***@localhost:5432/world_dsci513
13 rows affected.

[('United Kingdom',),
 ('Egypt',),
 ('Indonesia',),
 ('Iran',),
 ('Japan',),
 ('China',),
 ('Colombia',),
 ('Congo, The Democratic Republic of the',),
 ('South Korea',),
 ('Mexico',),
 ('Peru',),
 ('Thailand',),
 ('Russian Federation',)]

Well, as you might have guessed, we can rewrite this query using a **join**:

In [61]:
%%sql

SELECT
    co.name
FROM
    country co
JOIN
    city ci
ON
    co.capital = ci.id
WHERE
    ci.population > 5000000
;

   postgresql://postgres:***@localhost:5432/mds
 * postgresql://postgres:***@localhost:5432/world_dsci513
13 rows affected.

[('United Kingdom',),
 ('Egypt',),
 ('Indonesia',),
 ('Iran',),
 ('Japan',),
 ('China',),
 ('Colombia',),
 ('Congo, The Democratic Republic of the',),
 ('South Korea',),
 ('Mexico',),
 ('Peru',),
 ('Thailand',),
 ('Russian Federation',)]

Using a subquery is actually another way to gain access to data stored in other tables.

Typically, joins can be rewritten as a subquery and vice-versa, so what's the difference?

- Subqueries tend to be more readable and more intuitive
- Subqueries cannot be used if you need to include columns from the inner query in your results

---

**Example:** Retrieve the name of countries where English is an official language, and have a population of over 1 million.

---

In [85]:
%%sql

SELECT
    name
FROM
    country
WHERE
    population > 1000000
    AND
    code IN (
        SELECT
            countrycode
        FROM
            countrylanguage
        WHERE
            language = 'English'
            AND
            isofficial = True
    )
;

   postgresql://postgres:***@localhost:5432/mds
 * postgresql://postgres:***@localhost:5432/world_dsci513
10 rows affected.

[('Australia',),
 ('United Kingdom',),
 ('South Africa',),
 ('Hong Kong',),
 ('Ireland',),
 ('Canada',),
 ('Lesotho',),
 ('New Zealand',),
 ('United States',),
 ('Zimbabwe',)]

### Correlated subqueries

Subqueries that we have seen so far are called **simple or uncorrelated subqueries**, as they are executed **once** and **independently** of the outer query.

It sometimes happens that we need data from each row of the outer query in the subquery. This is an instance of what's called a **correlated subquery**. In a correlated subquery, the subquery takes the the current row of the outer query, and executes over all rows of the inner query. When finished, the next row from the outer query is selected, and the subquery is executed entirely for that outer row again, and so on.

---

**Example:** Which countries have the largest population in the continent where they are located?

---

The query for the above example requires the population of each country to be compared with all other countries that are in the same continent. The comparison of each row, with every other row that meet a particular condition can be achieved with a correlated subquery:

In [21]:
%%sql

SELECT
    c1.name, c1.continent
FROM
    country c1
WHERE
    c1.population = (
        SELECT
            MAX(c2.population)
        FROM
            country c2
        WHERE
            c2.continent = c1.continent
    )
;

   postgresql://postgres:***@localhost:5432/mds
 * postgresql://postgres:***@localhost:5432/world_dsci513
11 rows affected.

[('Australia', 'Oceania'),
 ('Brazil', 'South America'),
 ('China', 'Asia'),
 ('Nigeria', 'Africa'),
 ('Russian Federation', 'Europe'),
 ('United States', 'North America'),
 ('Antarctica', 'Antarctica'),
 ('Bouvet Island', 'Antarctica'),
 ('South Georgia and the South Sandwich Islands', 'Antarctica'),
 ('Heard Island and McDonald Islands', 'Antarctica'),
 ('French Southern territories', 'Antarctica')]

---

**Example:** Write a query that returns the most populated city listed for each country code in the `city` table.

---

In [74]:
%%sql

SELECT
    ci1.name, ci1.countrycode
FROM
    city ci1
WHERE
    ci1.population = (
        SELECT
            MAX(ci2.population)
        FROM
            city ci2
        WHERE
            ci2.countrycode = ci1.countrycode
    )
;

   postgresql://postgres:***@localhost:5432/mds
 * postgresql://postgres:***@localhost:5432/world_dsci513
232 rows affected.

[('Kabul', 'AFG'),
 ('Amsterdam', 'NLD'),
 ('Willemstad', 'ANT'),
 ('Tirana', 'ALB'),
 ('Alger', 'DZA'),
 ('Tafuna', 'ASM'),
 ('Andorra la Vella', 'AND'),
 ('Luanda', 'AGO'),
 ('South Hill', 'AIA'),
 ('Saint John´s', 'ATG'),
 ('Dubai', 'ARE'),
 ('Buenos Aires', 'ARG'),
 ('Yerevan', 'ARM'),
 ('Oranjestad', 'ABW'),
 ('Sydney', 'AUS'),
 ('Baku', 'AZE'),
 ('Nassau', 'BHS'),
 ('al-Manama', 'BHR'),
 ('Dhaka', 'BGD'),
 ('Bridgetown', 'BRB'),
 ('Antwerpen', 'BEL'),
 ('Belize City', 'BLZ'),
 ('Cotonou', 'BEN'),
 ('Saint George', 'BMU'),
 ('Thimphu', 'BTN'),
 ('Santa Cruz de la Sierra', 'BOL'),
 ('Sarajevo', 'BIH'),
 ('Gaborone', 'BWA'),
 ('São Paulo', 'BRA'),
 ('London', 'GBR'),
 ('Road Town', 'VGB'),
 ('Bandar Seri Begawan', 'BRN'),
 ('Sofija', 'BGR'),
 ('Ouagadougou', 'BFA'),
 ('Bujumbura', 'BDI'),
 ('George Town', 'CYM'),
 ('Santiago de Chile', 'CHL'),
 ('Avarua', 'COK'),
 ('San José', 'CRI'),
 ('Djibouti', 'DJI'),
 ('Roseau', 'DMA'),
 ('Santo Domingo de Guzmán', 'DOM'),
 ('Guayaquil', 'ECU'),
 ('Cairo', 'EGY'),
 ('San Salvador', 'SLV'),
 ('Asmara', 'ERI'),
 ('Madrid', 'ESP'),
 ('Cape Town', 'ZAF'),
 ('Addis Abeba', 'ETH'),
 ('Stanley', 'FLK'),
 ('Suva', 'FJI'),
 ('Quezon', 'PHL'),
 ('Tórshavn', 'FRO'),
 ('Libreville', 'GAB'),
 ('Serekunda', 'GMB'),
 ('Tbilisi', 'GEO'),
 ('Accra', 'GHA'),
 ('Gibraltar', 'GIB'),
 ('Saint George´s', 'GRD'),
 ('Nuuk', 'GRL'),
 ('Les Abymes', 'GLP'),
 ('Tamuning', 'GUM'),
 ('Ciudad de Guatemala', 'GTM'),
 ('Conakry', 'GIN'),
 ('Bissau', 'GNB'),
 ('Georgetown', 'GUY'),
 ('Port-au-Prince', 'HTI'),
 ('Tegucigalpa', 'HND'),
 ('Kowloon and New Kowloon', 'HKG'),
 ('Longyearbyen', 'SJM'),
 ('Jakarta', 'IDN'),
 ('Mumbai (Bombay)', 'IND'),
 ('Baghdad', 'IRQ'),
 ('Teheran', 'IRN'),
 ('Dublin', 'IRL'),
 ('Reykjavík', 'ISL'),
 ('Jerusalem', 'ISR'),
 ('Roma', 'ITA'),
 ('Dili', 'TMP'),
 ('Wien', 'AUT'),
 ('Spanish Town', 'JAM'),
 ('Tokyo', 'JPN'),
 ('Sanaa', 'YEM'),
 ('Amman', 'JOR'),
 ('Flying Fish Cove', 'CXR'),
 ('Beograd', 'YUG'),
 ('Phnom Penh', 'KHM'),
 ('Douala', 'CMR'),
 ('Montréal', 'CAN'),
 ('Praia', 'CPV'),
 ('Almaty', 'KAZ'),
 ('Nairobi', 'KEN'),
 ('Bangui', 'CAF'),
 ('Shanghai', 'CHN'),
 ('Bishkek', 'KGZ'),
 ('Bikenibeu', 'KIR'),
 ('Santafé de Bogotá', 'COL'),
 ('Moroni', 'COM'),
 ('Brazzaville', 'COG'),
 ('Kinshasa', 'COD'),
 ('Bantam', 'CCK'),
 ('Pyongyang', 'PRK'),
 ('Seoul', 'KOR'),
 ('Athenai', 'GRC'),
 ('Zagreb', 'HRV'),
 ('La Habana', 'CUB'),
 ('al-Salimiya', 'KWT'),
 ('Nicosia', 'CYP'),
 ('Vientiane', 'LAO'),
 ('Riga', 'LVA'),
 ('Maseru', 'LSO'),
 ('Beirut', 'LBN'),
 ('Monrovia', 'LBR'),
 ('Tripoli', 'LBY'),
 ('Schaan', 'LIE'),
 ('Vilnius', 'LTU'),
 ('Luxembourg [Luxemburg/Lëtzebuerg]', 'LUX'),
 ('El-Aaiún', 'ESH'),
 ('Macao', 'MAC'),
 ('Antananarivo', 'MDG'),
 ('Skopje', 'MKD'),
 ('Blantyre', 'MWI'),
 ('Male', 'MDV'),
 ('Kuala Lumpur', 'MYS'),
 ('Bamako', 'MLI'),
 ('Birkirkara', 'MLT'),
 ('Casablanca', 'MAR'),
 ('Dalap-Uliga-Darrit', 'MHL'),
 ('Fort-de-France', 'MTQ'),
 ('Nouakchott', 'MRT'),
 ('Port-Louis', 'MUS'),
 ('Mamoutzou', 'MYT'),
 ('Ciudad de México', 'MEX'),
 ('Weno', 'FSM'),
 ('Chisinau', 'MDA'),
 ('Monte-Carlo', 'MCO'),
 ('Ulan Bator', 'MNG'),
 ('Plymouth', 'MSR'),
 ('Maputo', 'MOZ'),
 ('Rangoon (Yangon)', 'MMR'),
 ('Windhoek', 'NAM'),
 ('Yangor', 'NRU'),
 ('Kathmandu', 'NPL'),
 ('Managua', 'NIC'),
 ('Niamey', 'NER'),
 ('Lagos', 'NGA'),
 ('Alofi', 'NIU'),
 ('Kingston', 'NFK'),
 ('Oslo', 'NOR'),
 ('Abidjan', 'CIV'),
 ('al-Sib', 'OMN'),
 ('Karachi', 'PAK'),
 ('Koror', 'PLW'),
 ('Ciudad de Panamá', 'PAN'),
 ('Port Moresby', 'PNG'),
 ('Asunción', 'PRY'),
 ('Lima', 'PER'),
 ('Adamstown', 'PCN'),
 ('Garapan', 'MNP'),
 ('Lisboa', 'PRT'),
 ('San Juan', 'PRI'),
 ('Warszawa', 'POL'),
 ('Malabo', 'GNQ'),
 ('Doha', 'QAT'),
 ('Paris', 'FRA'),
 ('Cayenne', 'GUF'),
 ('Faaa', 'PYF'),
 ('Saint-Denis', 'REU'),
 ('Bucuresti', 'ROM'),
 ('Kigali', 'RWA'),
 ('Stockholm', 'SWE'),
 ('Jamestown', 'SHN'),
 ('Basseterre', 'KNA'),
 ('Castries', 'LCA'),
 ('Kingstown', 'VCT'),
 ('Saint-Pierre', 'SPM'),
 ('Berlin', 'DEU'),
 ('Honiara', 'SLB'),
 ('Lusaka', 'ZMB'),
 ('Apia', 'WSM'),
 ('Serravalle', 'SMR'),
 ('São Tomé', 'STP'),
 ('Riyadh', 'SAU'),
 ('Pikine', 'SEN'),
 ('Victoria', 'SYC'),
 ('Freetown', 'SLE'),
 ('Singapore', 'SGP'),
 ('Bratislava', 'SVK'),
 ('Ljubljana', 'SVN'),
 ('Mogadishu', 'SOM'),
 ('Colombo', 'LKA'),
 ('Omdurman', 'SDN'),
 ('Helsinki [Helsingfors]', 'FIN'),
 ('Paramaribo', 'SUR'),
 ('Mbabane', 'SWZ'),
 ('Zürich', 'CHE'),
 ('Damascus', 'SYR'),
 ('Dushanbe', 'TJK'),
 ('Taipei', 'TWN'),
 ('Dar es Salaam', 'TZA'),
 ('København', 'DNK'),
 ('Bangkok', 'THA'),
 ('Lomé', 'TGO'),
 ('Fakaofo', 'TKL'),
 ('Nuku´alofa', 'TON'),
 ('Chaguanas', 'TTO'),
 ('N´Djaména', 'TCD'),
 ('Praha', 'CZE'),
 ('Tunis', 'TUN'),
 ('Istanbul', 'TUR'),
 ('Ashgabat', 'TKM'),
 ('Cockburn Town', 'TCA'),
 ('Funafuti', 'TUV'),
 ('Kampala', 'UGA'),
 ('Kyiv', 'UKR'),
 ('Budapest', 'HUN'),
 ('Montevideo', 'URY'),
 ('Nouméa', 'NCL'),
 ('Auckland', 'NZL'),
 ('Toskent', 'UZB'),
 ('Minsk', 'BLR'),
 ('Mata-Utu', 'WLF'),
 ('Port-Vila', 'VUT'),
 ('Città del Vaticano', 'VAT'),
 ('Caracas', 'VEN'),
 ('Moscow', 'RUS'),
 ('Ho Chi Minh City', 'VNM'),
 ('Tallinn', 'EST'),
 ('New York', 'USA'),
 ('Charlotte Amalie', 'VIR'),
 ('Harare', 'ZWE'),
 ('Gaza', 'PSE')]

---

**Example:** Use the above query to return the name of countries whose capital city is not their most populated city.

---

The outer query in a subquery can be the result of joining other tables. In this example, we first need to join `country` and `city` to list capital cities of each country:

In [25]:
%%sql

SELECT
    co.name, ci.name
FROM
    country co
JOIN
    city ci
ON
    co.capital = ci.id
;

   postgresql://postgres:***@localhost:5432/mds
 * postgresql://postgres:***@localhost:5432/world_dsci513
232 rows affected.

[('Afghanistan', 'Kabul'),
 ('Netherlands', 'Amsterdam'),
 ('Netherlands Antilles', 'Willemstad'),
 ('Albania', 'Tirana'),
 ('Algeria', 'Alger'),
 ('American Samoa', 'Fagatogo'),
 ('Andorra', 'Andorra la Vella'),
 ('Angola', 'Luanda'),
 ('Anguilla', 'The Valley'),
 ('Antigua and Barbuda', 'Saint John´s'),
 ('United Arab Emirates', 'Abu Dhabi'),
 ('Argentina', 'Buenos Aires'),
 ('Armenia', 'Yerevan'),
 ('Aruba', 'Oranjestad'),
 ('Australia', 'Canberra'),
 ('Azerbaijan', 'Baku'),
 ('Bahamas', 'Nassau'),
 ('Bahrain', 'al-Manama'),
 ('Bangladesh', 'Dhaka'),
 ('Barbados', 'Bridgetown'),
 ('Belgium', 'Bruxelles [Brussel]'),
 ('Belize', 'Belmopan'),
 ('Benin', 'Porto-Novo'),
 ('Bermuda', 'Hamilton'),
 ('Bhutan', 'Thimphu'),
 ('Bolivia', 'La Paz'),
 ('Bosnia and Herzegovina', 'Sarajevo'),
 ('Botswana', 'Gaborone'),
 ('Brazil', 'Brasília'),
 ('United Kingdom', 'London'),
 ('Virgin Islands, British', 'Road Town'),
 ('Brunei', 'Bandar Seri Begawan'),
 ('Bulgaria', 'Sofija'),
 ('Burkina Faso', 'Ouagadougou'),
 ('Burundi', 'Bujumbura'),
 ('Cayman Islands', 'George Town'),
 ('Chile', 'Santiago de Chile'),
 ('Cook Islands', 'Avarua'),
 ('Costa Rica', 'San José'),
 ('Djibouti', 'Djibouti'),
 ('Dominica', 'Roseau'),
 ('Dominican Republic', 'Santo Domingo de Guzmán'),
 ('Ecuador', 'Quito'),
 ('Egypt', 'Cairo'),
 ('El Salvador', 'San Salvador'),
 ('Eritrea', 'Asmara'),
 ('Spain', 'Madrid'),
 ('South Africa', 'Pretoria'),
 ('Ethiopia', 'Addis Abeba'),
 ('Falkland Islands', 'Stanley'),
 ('Fiji Islands', 'Suva'),
 ('Philippines', 'Manila'),
 ('Faroe Islands', 'Tórshavn'),
 ('Gabon', 'Libreville'),
 ('Gambia', 'Banjul'),
 ('Georgia', 'Tbilisi'),
 ('Ghana', 'Accra'),
 ('Gibraltar', 'Gibraltar'),
 ('Grenada', 'Saint George´s'),
 ('Greenland', 'Nuuk'),
 ('Guadeloupe', 'Basse-Terre'),
 ('Guam', 'Agaña'),
 ('Guatemala', 'Ciudad de Guatemala'),
 ('Guinea', 'Conakry'),
 ('Guinea-Bissau', 'Bissau'),
 ('Guyana', 'Georgetown'),
 ('Haiti', 'Port-au-Prince'),
 ('Honduras', 'Tegucigalpa'),
 ('Hong Kong', 'Victoria'),
 ('Svalbard and Jan Mayen', 'Longyearbyen'),
 ('Indonesia', 'Jakarta'),
 ('India', 'New Delhi'),
 ('Iraq', 'Baghdad'),
 ('Iran', 'Teheran'),
 ('Ireland', 'Dublin'),
 ('Iceland', 'Reykjavík'),
 ('Israel', 'Jerusalem'),
 ('Italy', 'Roma'),
 ('East Timor', 'Dili'),
 ('Austria', 'Wien'),
 ('Jamaica', 'Kingston'),
 ('Japan', 'Tokyo'),
 ('Yemen', 'Sanaa'),
 ('Jordan', 'Amman'),
 ('Christmas Island', 'Flying Fish Cove'),
 ('Yugoslavia', 'Beograd'),
 ('Cambodia', 'Phnom Penh'),
 ('Cameroon', 'Yaoundé'),
 ('Canada', 'Ottawa'),
 ('Cape Verde', 'Praia'),
 ('Kazakstan', 'Astana'),
 ('Kenya', 'Nairobi'),
 ('Central African Republic', 'Bangui'),
 ('China', 'Peking'),
 ('Kyrgyzstan', 'Bishkek'),
 ('Kiribati', 'Bairiki'),
 ('Colombia', 'Santafé de Bogotá'),
 ('Comoros', 'Moroni'),
 ('Congo', 'Brazzaville'),
 ('Congo, The Democratic Republic of the', 'Kinshasa'),
 ('Cocos (Keeling) Islands', 'West Island'),
 ('North Korea', 'Pyongyang'),
 ('South Korea', 'Seoul'),
 ('Greece', 'Athenai'),
 ('Croatia', 'Zagreb'),
 ('Cuba', 'La Habana'),
 ('Kuwait', 'Kuwait'),
 ('Cyprus', 'Nicosia'),
 ('Laos', 'Vientiane'),
 ('Latvia', 'Riga'),
 ('Lesotho', 'Maseru'),
 ('Lebanon', 'Beirut'),
 ('Liberia', 'Monrovia'),
 ('Libyan Arab Jamahiriya', 'Tripoli'),
 ('Liechtenstein', 'Vaduz'),
 ('Lithuania', 'Vilnius'),
 ('Luxembourg', 'Luxembourg [Luxemburg/Lëtzebuerg]'),
 ('Western Sahara', 'El-Aaiún'),
 ('Macao', 'Macao'),
 ('Madagascar', 'Antananarivo'),
 ('Macedonia', 'Skopje'),
 ('Malawi', 'Lilongwe'),
 ('Maldives', 'Male'),
 ('Malaysia', 'Kuala Lumpur'),
 ('Mali', 'Bamako'),
 ('Malta', 'Valletta'),
 ('Morocco', 'Rabat'),
 ('Marshall Islands', 'Dalap-Uliga-Darrit'),
 ('Martinique', 'Fort-de-France'),
 ('Mauritania', 'Nouakchott'),
 ('Mauritius', 'Port-Louis'),
 ('Mayotte', 'Mamoutzou'),
 ('Mexico', 'Ciudad de México'),
 ('Micronesia, Federated States of', 'Palikir'),
 ('Moldova', 'Chisinau'),
 ('Monaco', 'Monaco-Ville'),
 ('Mongolia', 'Ulan Bator'),
 ('Montserrat', 'Plymouth'),
 ('Mozambique', 'Maputo'),
 ('Myanmar', 'Rangoon (Yangon)'),
 ('Namibia', 'Windhoek'),
 ('Nauru', 'Yaren'),
 ('Nepal', 'Kathmandu'),
 ('Nicaragua', 'Managua'),
 ('Niger', 'Niamey'),
 ('Nigeria', 'Abuja'),
 ('Niue', 'Alofi'),
 ('Norfolk Island', 'Kingston'),
 ('Norway', 'Oslo'),
 ('Côte d\x92Ivoire', 'Yamoussoukro'),
 ('Oman', 'Masqat'),
 ('Pakistan', 'Islamabad'),
 ('Palau', 'Koror'),
 ('Panama', 'Ciudad de Panamá'),
 ('Papua New Guinea', 'Port Moresby'),
 ('Paraguay', 'Asunción'),
 ('Peru', 'Lima'),
 ('Pitcairn', 'Adamstown'),
 ('Northern Mariana Islands', 'Garapan'),
 ('Portugal', 'Lisboa'),
 ('Puerto Rico', 'San Juan'),
 ('Poland', 'Warszawa'),
 ('Equatorial Guinea', 'Malabo'),
 ('Qatar', 'Doha'),
 ('France', 'Paris'),
 ('French Guiana', 'Cayenne'),
 ('French Polynesia', 'Papeete'),
 ('Réunion', 'Saint-Denis'),
 ('Romania', 'Bucuresti'),
 ('Rwanda', 'Kigali'),
 ('Sweden', 'Stockholm'),
 ('Saint Helena', 'Jamestown'),
 ('Saint Kitts and Nevis', 'Basseterre'),
 ('Saint Lucia', 'Castries'),
 ('Saint Vincent and the Grenadines', 'Kingstown'),
 ('Saint Pierre and Miquelon', 'Saint-Pierre'),
 ('Germany', 'Berlin'),
 ('Solomon Islands', 'Honiara'),
 ('Zambia', 'Lusaka'),
 ('Samoa', 'Apia'),
 ('San Marino', 'San Marino'),
 ('Sao Tome and Principe', 'São Tomé'),
 ('Saudi Arabia', 'Riyadh'),
 ('Senegal', 'Dakar'),
 ('Seychelles', 'Victoria'),
 ('Sierra Leone', 'Freetown'),
 ('Singapore', 'Singapore'),
 ('Slovakia', 'Bratislava'),
 ('Slovenia', 'Ljubljana'),
 ('Somalia', 'Mogadishu'),
 ('Sri Lanka', 'Colombo'),
 ('Sudan', 'Khartum'),
 ('Finland', 'Helsinki [Helsingfors]'),
 ('Suriname', 'Paramaribo'),
 ('Swaziland', 'Mbabane'),
 ('Switzerland', 'Bern'),
 ('Syria', 'Damascus'),
 ('Tajikistan', 'Dushanbe'),
 ('Taiwan', 'Taipei'),
 ('Tanzania', 'Dodoma'),
 ('Denmark', 'København'),
 ('Thailand', 'Bangkok'),
 ('Togo', 'Lomé'),
 ('Tokelau', 'Fakaofo'),
 ('Tonga', 'Nuku´alofa'),
 ('Trinidad and Tobago', 'Port-of-Spain'),
 ('Chad', 'N´Djaména'),
 ('Czech Republic', 'Praha'),
 ('Tunisia', 'Tunis'),
 ('Turkey', 'Ankara'),
 ('Turkmenistan', 'Ashgabat'),
 ('Turks and Caicos Islands', 'Cockburn Town'),
 ('Tuvalu', 'Funafuti'),
 ('Uganda', 'Kampala'),
 ('Ukraine', 'Kyiv'),
 ('Hungary', 'Budapest'),
 ('Uruguay', 'Montevideo'),
 ('New Caledonia', 'Nouméa'),
 ('New Zealand', 'Wellington'),
 ('Uzbekistan', 'Toskent'),
 ('Belarus', 'Minsk'),
 ('Wallis and Futuna', 'Mata-Utu'),
 ('Vanuatu', 'Port-Vila'),
 ('Holy See (Vatican City State)', 'Città del Vaticano'),
 ('Venezuela', 'Caracas'),
 ('Russian Federation', 'Moscow'),
 ('Vietnam', 'Hanoi'),
 ('Estonia', 'Tallinn'),
 ('United States', 'Washington'),
 ('Virgin Islands, U.S.', 'Charlotte Amalie'),
 ('Zimbabwe', 'Harare'),
 ('Palestine', 'Gaza')]

In the next step, we need to check whether the population of that capital city is the maximum population of cities of that particular country or not. This can be achieved via a correlated subquery:

In [29]:
%%sql

SELECT
    co.name
FROM
    country co
JOIN
    city ci
ON
    co.capital = ci.id
WHERE
    ci.population <> (
        SELECT
            MAX(ci2.population)
        FROM
            city ci2
        WHERE
            ci.countrycode = ci2.countrycode
    )
ORDER BY
    co.population DESC
;

   postgresql://postgres:***@localhost:5432/mds
 * postgresql://postgres:***@localhost:5432/world_dsci513
48 rows affected.

[('China',),
 ('India',),
 ('United States',),
 ('Brazil',),
 ('Pakistan',),
 ('Nigeria',),
 ('Vietnam',),
 ('Philippines',),
 ('Turkey',),
 ('South Africa',),
 ('Tanzania',),
 ('Canada',),
 ('Sudan',),
 ('Morocco',),
 ('Australia',),
 ('Kazakstan',),
 ('Cameroon',),
 ('Côte d\x92Ivoire',),
 ('Ecuador',),
 ('Malawi',),
 ('Belgium',),
 ('Senegal',),
 ('Bolivia',),
 ('Switzerland',),
 ('Hong Kong',),
 ('Benin',),
 ('New Zealand',),
 ('Jamaica',),
 ('Oman',),
 ('United Arab Emirates',),
 ('Kuwait',),
 ('Gambia',),
 ('Trinidad and Tobago',),
 ('Guadeloupe',),
 ('Malta',),
 ('Belize',),
 ('French Polynesia',),
 ('Guam',),
 ('Micronesia, Federated States of',),
 ('Kiribati',),
 ('American Samoa',),
 ('Bermuda',),
 ('Monaco',),
 ('Liechtenstein',),
 ('San Marino',),
 ('Nauru',),
 ('Anguilla',),
 ('Cocos (Keeling) Islands',)]

Correlated subqueries are usually quite inefficient (remember time complexity of nested loops from DSCI 512?), but they can answer some interesting and complex questions.

### `ANY` and `ALL`

Syntax:

```sql
SELECT
    column_name(s)
FROM
    table_name
WHERE
    column_name operator {ALL|ANY} (
        SELECT
            column_name
        FROM
            table_name
        WHERE
            condition
    );
```

---

**Example:** Find all non-European countries whose population is larger than every European country.

---

In [30]:
%%sql

SELECT
    name
FROM
    country
WHERE
    continent <> 'Europe'
    AND
    population > ALL (
        SELECT
            population
        FROM
            country
        WHERE
            continent = 'Europe'
    )
;

   postgresql://postgres:***@localhost:5432/mds
 * postgresql://postgres:***@localhost:5432/world_dsci513
6 rows affected.

[('Brazil',),
 ('Indonesia',),
 ('India',),
 ('China',),
 ('Pakistan',),
 ('United States',)]

---

**Example:** Find all European countries whose population is smaller than at least one city in the US.

---

In [106]:
%%sql

SELECT
    name
FROM
    country
WHERE
    continent = 'Europe'
    AND
    population < ANY (
        SELECT
            population
        FROM
            city
        WHERE
            countrycode = (
                SELECT
                    code
                FROM
                    country
                WHERE
                    name ILIKE '%United%States'
            )
    )
;

   postgresql://postgres:***@localhost:5432/mds
 * postgresql://postgres:***@localhost:5432/world_dsci513
26 rows affected.

[('Albania',),
 ('Andorra',),
 ('Bosnia and Herzegovina',),
 ('Faroe Islands',),
 ('Gibraltar',),
 ('Svalbard and Jan Mayen',),
 ('Ireland',),
 ('Iceland',),
 ('Croatia',),
 ('Latvia',),
 ('Liechtenstein',),
 ('Lithuania',),
 ('Luxembourg',),
 ('Macedonia',),
 ('Malta',),
 ('Moldova',),
 ('Monaco',),
 ('Norway',),
 ('San Marino',),
 ('Slovakia',),
 ('Slovenia',),
 ('Finland',),
 ('Switzerland',),
 ('Denmark',),
 ('Holy See (Vatican City State)',),
 ('Estonia',)]

Subqueries written with `ALL` or `ANY` and `<`, `<=`, `>`, and `>=` be rewritten using aggregations. For example, we can rewrite the above query as:

In [109]:
%%sql

SELECT
    name
FROM
    country
WHERE
    continent = 'Europe'
    AND
    population < (
        SELECT
            MAX(population)
        FROM
            city
        WHERE
            countrycode = (
                SELECT
                    code
                FROM
                    country
                WHERE
                    name ILIKE '%United%States'
            )
    )
;

   postgresql://postgres:***@localhost:5432/mds
 * postgresql://postgres:***@localhost:5432/world_dsci513
26 rows affected.

[('Albania',),
 ('Andorra',),
 ('Bosnia and Herzegovina',),
 ('Faroe Islands',),
 ('Gibraltar',),
 ('Svalbard and Jan Mayen',),
 ('Ireland',),
 ('Iceland',),
 ('Croatia',),
 ('Latvia',),
 ('Liechtenstein',),
 ('Lithuania',),
 ('Luxembourg',),
 ('Macedonia',),
 ('Malta',),
 ('Moldova',),
 ('Monaco',),
 ('Norway',),
 ('San Marino',),
 ('Slovakia',),
 ('Slovenia',),
 ('Finland',),
 ('Switzerland',),
 ('Denmark',),
 ('Holy See (Vatican City State)',),
 ('Estonia',)]

Here are equivalencies between using `ALL` and `ANY` with `MAX` and `MIN` in subqueries:

| Using `ALL` and `ANY` | Using `MIN` and `MAX` |
|-----------------------|-----------------------|
| `< ALL (subquery)`    | `< MIN(values)`       |
| `> ALL (subquery)`    | `> MAX(values)`       |
| `< ANY (subquery)`    | `< MAX(values)`       |
| `< ANY (subquery)`    | `> MIN(values)`       |

> **Remember:** The fact that two queries achieve the same result does not mean that they are also the same in terms of performance. For example, using `> MAX()` is usually faster than `> ALL()`.

### `EXISTS`

With subqueries, sometimes we don't care about the rows that are returned, but if a row is returned at all or not. The `EXISTS` and `NOT EXISTS` keyword in SQL provide this type of functionality for us, i.e., the check for **existence** of rows, not their values. Here is the syntax for an `EXISTS` subquery:

```sql
SELECT
    column_name(s)
FROM
    table_name
WHERE
    [NOT] EXISTS (
        SELECT column_name FROM table_name WHERE condition
    )
;
```

If the subquery returns one or more rows, then the `WHERE` condition becomes `TRUE`.

Remember that:
- With `EXISTS`, the columns returned by the subquery do not matter at all, which is why we usually use `SELECT *` in the subquery.
- The subquery following `EXISTS` can be either simple or correlated, but typically they are correlated.

---

**Example:** Find all countries that have at least a city with a population greater that 5 million.

---

In [114]:
%%sql

SELECT
    co.name
FROM
    country co
WHERE
    EXISTS (
        SELECT
            *
        FROM
            city ci
        WHERE
            co.code = ci.countrycode
            AND
            ci.population > 5000000
    )
;

   postgresql://postgres:***@localhost:5432/mds
 * postgresql://postgres:***@localhost:5432/world_dsci513
18 rows affected.

[('Brazil',),
 ('United Kingdom',),
 ('Egypt',),
 ('Indonesia',),
 ('India',),
 ('Iran',),
 ('Japan',),
 ('China',),
 ('Colombia',),
 ('Congo, The Democratic Republic of the',),
 ('South Korea',),
 ('Mexico',),
 ('Pakistan',),
 ('Peru',),
 ('Thailand',),
 ('Turkey',),
 ('Russian Federation',),
 ('United States',)]

---

**Example:** Which countries speak at least one language that is not spoken in any other country in their continent?

---

It's best to first create a temporary table that stores the names of countries, continents and their languages:

In [44]:
%%sql

DROP TABLE IF EXISTS ccl;

CREATE TEMPORARY TABLE ccl AS (
    SELECT
        co.name, co.continent, cl.language
    FROM
        country co
    JOIN
        countrylanguage cl
    ON
        co.code = cl.countrycode
    WHERE
        co.continent IN ('Asia', 'Europe')
)
;

   postgresql://postgres:***@localhost:5432/mds
 * postgresql://postgres:***@localhost:5432/world_dsci513
Done.
441 rows affected.

[]

Now we can use `NOT EXISTS` to detect countries that have languages not spoken elsewhere in their continent. Note that because a subquery runs its query over all rows, we need to exclude the current row of the outer query, otherwise there would always be a country in the same continent speaking all languages of the country in the outer query, i.e. itself!

In [45]:
%%sql

SELECT
    t1.*
FROM
    ccl t1
WHERE
    NOT EXISTS (
        SELECT
            *
        FROM
            ccl t2
        WHERE
            t1.name <> t2.name
            AND
            t1.continent = t2.continent
            AND
            t1.language = t2.language
    )

   postgresql://postgres:***@localhost:5432/mds
 * postgresql://postgres:***@localhost:5432/world_dsci513
129 rows affected.

[('Bhutan', 'Asia', 'Dzongkha'),
 ('Philippines', 'Asia', 'Pilipino'),
 ('Faroe Islands', 'Europe', 'Faroese'),
 ('Georgia', 'Asia', 'Georgiana'),
 ('Indonesia', 'Asia', 'Javanese'),
 ('Iceland', 'Europe', 'Icelandic'),
 ('Japan', 'Asia', 'Japanese'),
 ('Kyrgyzstan', 'Asia', 'Kirgiz'),
 ('Cyprus', 'Asia', 'Greek'),
 ('Latvia', 'Europe', 'Latvian'),
 ('Luxembourg', 'Europe', 'Luxembourgish'),
 ('Maldives', 'Asia', 'Dhivehi'),
 ('Malta', 'Europe', 'Maltese'),
 ('Myanmar', 'Asia', 'Burmese'),
 ('Sri Lanka', 'Asia', 'Singali'),
 ('Taiwan', 'Asia', 'Min'),
 ('Afghanistan', 'Asia', 'Dari'),
 ('Netherlands', 'Europe', 'Fries'),
 ('Bangladesh', 'Asia', 'Chakma'),
 ('United Kingdom', 'Europe', 'Kymri'),
 ('Brunei', 'Asia', 'Malay-English'),
 ('Philippines', 'Asia', 'Cebuano'),
 ('Ireland', 'Europe', 'Irish'),
 ('Italy', 'Europe', 'Sardinian'),
 ('Yemen', 'Asia', 'Soqutri'),
 ('Jordan', 'Asia', 'Circassian'),
 ('China', 'Asia', 'Zhuang'),
 ('Laos', 'Asia', 'Mon-khmer'),
 ('Monaco', 'Europe', 'Monegasque'),
 ('Myanmar', 'Asia', 'Shan'),
 ('Nepal', 'Asia', 'Maithili'),
 ('Czech Republic', 'Europe', 'Moravian'),
 ('Russian Federation', 'Europe', 'Tatar'),
 ('Vietnam', 'Asia', 'Tho'),
 ('Azerbaijan', 'Asia', 'Lezgian'),
 ('Bangladesh', 'Asia', 'Marma'),
 ('United Kingdom', 'Europe', 'Gaeli'),
 ('Spain', 'Europe', 'Galecian'),
 ('Philippines', 'Asia', 'Ilocano'),
 ('Hong Kong', 'Asia', 'Fukien'),
 ('India', 'Asia', 'Telugu'),
 ('Italy', 'Europe', 'Friuli'),
 ('China', 'Asia', 'Mant\x9au'),
 ('Lebanon', 'Asia', 'French'),
 ('Mongolia', 'Asia', 'Dorbet'),
 ('Myanmar', 'Asia', 'Karen'),
 ('Nepal', 'Asia', 'Bhojpuri'),
 ('Pakistan', 'Asia', 'Sindhi'),
 ('Sri Lanka', 'Asia', 'Mixed Languages'),
 ('Bangladesh', 'Asia', 'Garo'),
 ('Spain', 'Europe', 'Basque'),
 ('Philippines', 'Asia', 'Hiligaynon'),
 ('Indonesia', 'Asia', 'Madura'),
 ('India', 'Asia', 'Marathi'),
 ('Iraq', 'Asia', 'Assyrian'),
 ('Iran', 'Asia', 'Gilaki'),
 ('Cambodia', 'Asia', 'T\x9aam'),
 ('Kazakstan', 'Asia', 'German'),
 ('China', 'Asia', 'Hui'),
 ('Laos', 'Asia', 'Lao-Soung'),
 ('Malaysia', 'Asia', 'Iban'),
 ('Moldova', 'Europe', 'Gagauzi'),
 ('Mongolia', 'Asia', 'Bajad'),
 ('Myanmar', 'Asia', 'Rakhine'),
 ('Nepal', 'Asia', 'Tharu'),
 ('Pakistan', 'Asia', 'Saraiki'),
 ('Slovakia', 'Europe', 'Czech and Moravian'),
 ('Switzerland', 'Europe', 'Romansh'),
 ('Taiwan', 'Asia', 'Ami'),
 ('Russian Federation', 'Europe', 'Chuvash'),
 ('Vietnam', 'Asia', 'Muong'),
 ('Bangladesh', 'Asia', 'Khasi'),
 ('Philippines', 'Asia', 'Bicol'),
 ('Georgia', 'Asia', 'Osseetti'),
 ('Hong Kong', 'Asia', 'Chiu chau'),
 ('Indonesia', 'Asia', 'Minangkabau'),
 ('Iran', 'Asia', 'Luri'),
 ('Japan', 'Asia', 'Philippene Languages'),
 ('Mongolia', 'Asia', 'Buryat'),
 ('Myanmar', 'Asia', 'Mon'),
 ('Nepal', 'Asia', 'Tamang'),
 ('Slovakia', 'Europe', 'Ukrainian and Russian'),
 ('Taiwan', 'Asia', 'Atayal'),
 ('Uzbekistan', 'Asia', 'Karakalpak'),
 ('Russian Federation', 'Europe', 'Bashkir'),
 ('Bangladesh', 'Asia', 'Santhali'),
 ('Philippines', 'Asia', 'Waray-waray'),
 ('Georgia', 'Asia', 'Abhyasi'),
 ('Indonesia', 'Asia', 'Batakki'),
 ('Iran', 'Asia', 'Mazandarani'),
 ('Japan', 'Asia', 'Ainu'),
 ('China', 'Asia', 'Uighur'),
 ('Malaysia', 'Asia', 'Dusun'),
 ('Mongolia', 'Asia', 'Dariganga'),
 ('Myanmar', 'Asia', 'Chin'),
 ('Nepal', 'Asia', 'Newari'),
 ('Taiwan', 'Asia', 'Paiwan'),
 ('Thailand', 'Asia', 'Kuy'),
 ('Czech Republic', 'Europe', 'Silesiana'),
 ('Russian Federation', 'Europe', 'Chechen'),
 ('Bangladesh', 'Asia', 'Tripuri'),
 ('Philippines', 'Asia', 'Pampango'),
 ('Indonesia', 'Asia', 'Bugi'),
 ('India', 'Asia', 'Gujarati'),
 ('China', 'Asia', 'Yi'),
 ('Myanmar', 'Asia', 'Kachin'),
 ('Pakistan', 'Asia', 'Hindko'),
 ('Russian Federation', 'Europe', 'Mordva'),
 ('Vietnam', 'Asia', 'Nung'),
 ('Philippines', 'Asia', 'Pangasinan'),
 ('Indonesia', 'Asia', 'Banja'),
 ('India', 'Asia', 'Kannada'),
 ('China', 'Asia', 'Tujia'),
 ('Myanmar', 'Asia', 'Kayah'),
 ('Pakistan', 'Asia', 'Brahui'),
 ('Russian Federation', 'Europe', 'Kazakh'),
 ('Philippines', 'Asia', 'Maguindanao'),
 ('Indonesia', 'Asia', 'Bali'),
 ('India', 'Asia', 'Malajalam'),
 ('Iran', 'Asia', 'Bakhtyari'),
 ('Russian Federation', 'Europe', 'Avarian'),
 ('Vietnam', 'Asia', 'Man'),
 ('Philippines', 'Asia', 'Maranao'),
 ('India', 'Asia', 'Orija'),
 ('China', 'Asia', 'Tibetan'),
 ('Russian Federation', 'Europe', 'Mari'),
 ('China', 'Asia', 'Puyi'),
 ('Russian Federation', 'Europe', 'Udmur'),
 ('China', 'Asia', 'Dong')]

We can also replace `t1.*` in the `SELECT` clause with `COUNT(DISTINCT name)` to find how many countries with such a property exist in the world.

To summarize, we use `EXISTS` when:

- We don't need the data from a related table. With joins, we always have access to the columns of the target tables as well.
- We just need to check existence, which can also be achieved by using outer joins and checking for nulls.

---

**Example:** Find city names that happen to be used in more than one country!

---

In [46]:
%%sql

SELECT
    DISTINCT ci1.name
FROM
    city ci1
WHERE
    EXISTS (
        SELECT
            ci2.name
        FROM
            city ci2
        WHERE
            ci2.name = ci1.name
            AND
            ci1.id <> ci2.id
            AND
            ci1.countrycode <> ci2.countrycode
    )
ORDER BY
    ci1.name DESC
;

   postgresql://postgres:***@localhost:5432/mds
 * postgresql://postgres:***@localhost:5432/world_dsci513
47 rows affected.

[('York',),
 ('Worcester',),
 ('Victoria',),
 ('Vancouver',),
 ('Valencia',),
 ('Tripoli',),
 ('Toledo',),
 ('Taiping',),
 ('Santa Rosa',),
 ('Santa Maria',),
 ('Santa Clara',),
 ('Santa Ana',),
 ('San Miguel',),
 ('San Mateo',),
 ('San Juan',),
 ('San Jose',),
 ('San Fernando',),
 ('San Felipe',),
 ('Salem',),
 ('Salamanca',),
 ('Saint John´s',),
 ('Richmond',),
 ('Portsmouth',),
 ('Plymouth',),
 ('Newcastle',),
 ('Mérida',),
 ('Manzanillo',),
 ('Manchester',),
 ('Los Angeles',),
 ('London',),
 ('León',),
 ('La Paz',),
 ('Kingston',),
 ('Hyderabad',),
 ('Hamilton',),
 ('Halifax',),
 ('Gloucester',),
 ('Ede',),
 ('Córdoba',),
 ('Colombo',),
 ('Cartagena',),
 ('Cambridge',),
 ('Brest',),
 ('Birmingham',),
 ('Barcelona',),
 ('Anyang',),
 ('Alexandria',)]

Alternatively, we can use a self-join to find city names used in more than one country:

In [48]:
%%sql

SELECT
    DISTINCT ON (ci1.name) ci1.name,
    ci1.countrycode,
    ci2.name,
    ci2.countrycode
FROM
    city ci1
JOIN
    city ci2
ON
    ci2.name = ci1.name
    AND
    ci1.id <> ci2.id
    AND
    ci1.countrycode <> ci2.countrycode
ORDER BY
    ci1.name DESC
;

   postgresql://postgres:***@localhost:5432/mds
 * postgresql://postgres:***@localhost:5432/world_dsci513
47 rows affected.

[('York', 'CAN', 'York', 'GBR'),
 ('Worcester', 'USA', 'Worcester', 'GBR'),
 ('Victoria', 'MEX', 'Victoria', 'SYC'),
 ('Vancouver', 'CAN', 'Vancouver', 'USA'),
 ('Valencia', 'ESP', 'Valencia', 'VEN'),
 ('Tripoli', 'LBY', 'Tripoli', 'LBN'),
 ('Toledo', 'BRA', 'Toledo', 'PHL'),
 ('Taiping', 'MYS', 'Taiping', 'TWN'),
 ('Santa Rosa', 'PHL', 'Santa Rosa', 'USA'),
 ('Santa Maria', 'BRA', 'Santa Maria', 'PHL'),
 ('Santa Clara', 'USA', 'Santa Clara', 'CUB'),
 ('Santa Ana', 'USA', 'Santa Ana', 'SLV'),
 ('San Miguel', 'ARG', 'San Miguel', 'PHL'),
 ('San Mateo', 'USA', 'San Mateo', 'PHL'),
 ('San Juan', 'PRI', 'San Juan', 'ARG'),
 ('San Jose', 'USA', 'San Jose', 'PHL'),
 ('San Fernando', 'PHL', 'San Fernando', 'ARG'),
 ('San Felipe', 'MEX', 'San Felipe', 'VEN'),
 ('Salem', 'IND', 'Salem', 'USA'),
 ('Salamanca', 'ESP', 'Salamanca', 'MEX'),
 ('Saint John´s', 'CAN', 'Saint John´s', 'ATG'),
 ('Richmond', 'CAN', 'Richmond', 'USA'),
 ('Portsmouth', 'GBR', 'Portsmouth', 'USA'),
 ('Plymouth', 'GBR', 'Plymouth', 'MSR'),
 ('Newcastle', 'ZAF', 'Newcastle', 'AUS'),
 ('Mérida', 'MEX', 'Mérida', 'VEN'),
 ('Manzanillo', 'CUB', 'Manzanillo', 'MEX'),
 ('Manchester', 'USA', 'Manchester', 'GBR'),
 ('Los Angeles', 'USA', 'Los Angeles', 'CHL'),
 ('London', 'GBR', 'London', 'CAN'),
 ('León', 'NIC', 'León', 'MEX'),
 ('La Paz', 'BOL', 'La Paz', 'MEX'),
 ('Kingston', 'NFK', 'Kingston', 'JAM'),
 ('Hyderabad', 'PAK', 'Hyderabad', 'IND'),
 ('Hamilton', 'NZL', 'Hamilton', 'CAN'),
 ('Halifax', 'CAN', 'Halifax', 'GBR'),
 ('Gloucester', 'GBR', 'Gloucester', 'CAN'),
 ('Ede', 'NLD', 'Ede', 'NGA'),
 ('Córdoba', 'ESP', 'Córdoba', 'MEX'),
 ('Colombo', 'LKA', 'Colombo', 'BRA'),
 ('Cartagena', 'COL', 'Cartagena', 'ESP'),
 ('Cambridge', 'CAN', 'Cambridge', 'GBR'),
 ('Brest', 'FRA', 'Brest', 'BLR'),
 ('Birmingham', 'GBR', 'Birmingham', 'USA'),
 ('Barcelona', 'VEN', 'Barcelona', 'ESP'),
 ('Anyang', 'CHN', 'Anyang', 'KOR'),
 ('Alexandria', 'USA', 'Alexandria', 'EGY')]

## Set operators (OPTIONAL)

 The set operations are used to combine different `SELECT` statements. All the three set operators require that the `SELECT` clause lists the same number of columns.

- `UNION` combines all rows from both selects into the same table. It removes duplicates. (use UNION ALL to keep duplicates).

- `INTERSECT` combines only rows that are present in both tables. It removes duplicates. (use INTERSECT ALL to keep duplicates).

- `EXCEPT` only keeps the rows that are in the first table but are not in the second table.